const TIME_MAPPING = {
  "A": "07:10 ~ 08:00",
  "1": "08:10 ~ 09:00",
  "2": "09:10 ~ 10:00",
  "3": "10:20 ~ 11:10",
  "4": "11:20 ~ 12:10",
  "B": "12:10 ~ 13:00",
  "5": "13:10 ~ 14:00",
  "6": "14:10 ~ 15:00",
  "7": "15:20 ~ 16:10",
  "8": "16:20 ~ 17:10",
  "9": "17:20 ~ 18:10",
  "C": "18:20 ~ 19:10",
  "D": "19:20 ~ 20:10",
  "E": "20:20 ~ 21:10",
  "F": "21:20 ~ 22:10"
};

const COURSE_TYPE = ['選修', '必修', '通識', '體育', '軍訓', '外語'];

const BERIEF_CODE = {
  'A501': '核心(人文)',
  'A502': '核心(社會)',
  'A503': '核心(自然)',
  'A504': '跨院',
  'A505': '校基本'
}

const YEAR = '114', SEMESTER = '2';
const APP_URL = `${location.protocol}//${location.host}${location.pathname}`;

const DEV = location.hostname === '127.0.0.1';